# =============================================================================
# # 최대공약수
# 6의 약수: 1, 2, 3, 6
# 8의 약수: 1, 2, 4, 8
# 6과 8의 공통약수 1, 2중에서 큰수 2
# 따라서 6과 8의 최대공약수는 2이다.
# =============================================================================

# =============================================================================
# # 최소공배수
# 10의 배수: 10, 20, 30, 40, 50, 60, 70, ...
# 12의 배수: 12, 24, 36, 48, 60, 72, ...
# 10과 12의 공통배수 60, 120, ...공통 배수중에서 작은수 60.
# 따라서 10과 12의 최소공배수는 60이다.
# =============================================================================

# 최대공약수True와 최소공배수False 구하기

switchTF = False

num1 = int(input("첫번째 수를 입력하세요: "))
num2 = int(input("두번째 수를 입력하세요: "))

def calFactor():
    # 약수계산
    for i in range(min(num1, num2), 0, -1):
        if (num1 % i) == 0 and (num2 % i) == 0:
            return i
            

def calMultiple():
    # 배수계산
     for i in range(max(num1, num2), (num1*num2)+1):
        if (i % num1) == 0 and (i % num2) == 0:
            return i
    
#출력함수
def valOutput():
    global arrNum
    result = calFactor() if switchTF else calMultiple()
    print(result)
    
        
valOutput()


    