# -*- coding: utf-8 -*-
"""
2021년 1학기동안 배운 내용을 복습해봅시다 ^^
"""

# 1. 두 수를 입력받아서, 출력합니다.

# =============================================================================
# num1 = input("Enter Number1: ") 
# num2 = input("Enter Number2: ") 
# print("첫번째 숫자는: " + num1 + "입니다.")
# print("두번째 숫자는: ", "입니다.", sep = num2)
# =============================================================================


 # 2. 두 수를 입력받아서, 
 #    짝수인지 홀수인지 출력합니다.
# =============================================================================
# num1 = input("Enter Number1: ") 
# num2 = input("Enter Number2: ") 
# 
# if (int(num) % 2) == 0:
#     print("첫번째 숫자는: 짝수입니다.")
# else:
#     print("첫번째 숫자는: 홀수입니다.")
#     
# if (int(num2) % 2) == 0:
#     print("두번째 숫자는: 짝수입니다.")
# else:
#     print("두번째 숫자는: 홀수입니다.")
# =============================================================================
    
 # 3. 두 수를 입력받아서, 
 #    함수(){짝수,홀수 알고리즘} 
 # 출력합니다.
# =============================================================================
# num1 = input("Enter Number1: ") 
# num2 = input("Enter Number2: ") 
# 
# def evenORodd(num):
#     if (int(num) % 2 == 0):
#         print("짝수입니다.")
#     else:
#         print("홀수입니다.")
#         
# evenORodd(num1)
# evenORodd(num2)
# =============================================================================
   
 # 4. 빈 배열을 만들고, 
 #    하나의 수를 입력받아서, 
 #    배열에 추가 np.append후,
 #    배열값을 출력합니다. 
# =============================================================================
# import numpy as np
#  
# arrNum = np.array([])
#     
# v = input("값을 입력하세요: ")
# arrNum = np.append(arrNum, v)
# print("배열값은: " + arrNum[0])
# =============================================================================

 # 5. 빈 배열을 만들고, 
 #    입력함수를 작성:
 #    {하나의 수를 입력받아서, 
 #    배열에 추가 np.append후,
 #    배열값을 출력합니다. }
# =============================================================================
# import numpy as np
# 
# arrNum = np.array([])
# 
# def valInput(arrNum, v):
#     arrNum = np.append(arrNum, v)
#     print(arrNum[0])
#     
# valInput(arrNum, input("값을 입력하세요: "))
# =============================================================================

 # 6. 빈 배열을 만들고, 
 #    입력함수를 작성:
 #    {하나의 수를 입력받아서, 
 #    배열에 추가 np.append후}
 #    출력함수를 작성:
 # 파이썬의 global키워드를 사용하여,
 # 전역함수를 익혀본다.
# =============================================================================
# import numpy as np
# 
# arrNum = np.array([])
# 
# def valInput(v):
#     global arrNum
#     arrNum = np.append(arrNum, v)
#     
# def valOutput():
#     global arrNum
#     print(arrNum[0])
# 
# valInput(input("값을 입력하세요: "))
# valOutput()
# =============================================================================

 # 7. 빈 배열을 만들고, 
 #    입력함수를 작성:
 #    출력함수를 작성:
 #    cnt만큼 값을 입력input받는다.
# =============================================================================
# import numpy as np
#  
# cnt = 3
# arrNum = np.array([])
#  
# def valInput(v):
#     global arrNum
#     arrNum = np.append(arrNum, v)
#      
# def valOutput(i):
#    global arrNum
#    print(str(i) + "번째 배열값: " + arrNum[i])
#    
# for i in range(cnt):
#     valInput(input("값을 입력하세요: "))
#     #print("배열의 ", "번째 값은", sep = str(i))
#     
# for i in range(cnt):
#     valOutput(i)
# =============================================================================


    

    

 
 

















